Autodesk.Revit.DB.WireframeBuilder.ValidateCurve(Autodesk.Revit.DB.Curve)
Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input.
This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve().
GCurve:
Curve object to be validated.
Returns:
True is %GCurve% is acceptable as a part of a wireframe shape representation being built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.WireframeBuilder.ValidatePoint(Autodesk.Revit.DB.Point)
Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input.
Remarks:
This function may be used to pre-validate the geometry being added to avoid an exception from AddPoint().
GPoint:
Point object to be validated.
Returns:
True is %GPoint% is acceptable as a part of a wireframe shape representation being built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.WireframeBuilder.AddCurve(Autodesk.Revit.DB.Curve)
Add a curve to the shape representation stored in this WireframeBuilder.
GCurve:
The curve to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
GCurve is not acceptable for a wireframe shape representation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.WireframeBuilder.AddPoint(Autodesk.Revit.DB.Point)
Add a point to the shape representation stored in this WireframeBuilder.
GPoint:
The point to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
GPoint is not acceptable for a wireframe shape representation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.WireframeBuilder.Reset
Clears the accumulated geometry.
Since:
2016

Autodesk.Revit.DB.WireframeBuilder.#ctor
Default constructor.
Since:
2016

Autodesk.Revit.DB.WireframeBuilder
Constructs a shape representation consisting of points and curves. That shape would typically be stored in a DirectShape or a DirectShapeType object.
Since:
2016